synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pm.h
/* -------- PM_HSBMASK : (PM Offset: 0x024) (R/W 32) HSB Mask -------- */
#define PM_HSBMASK_OFFSET           0x024        /**< \brief (PM_HSBMASK offset) HSB Mask */
#define PM_HSBMASK_RESETVALUE       0x000001E2   /**< \brief (PM_HSBMASK reset_value) HSB Mask */

#define PM_HSBMASK_PDCA_Pos         0            /**< \brief (PM_HSBMASK) PDCA HSB Clock Mask */
#define PM_HSBMASK_PDCA             (0x1u << PM_HSBMASK_PDCA_Pos)
#define PM_HSBMASK_HFLASHC_Pos      1            /**< \brief (PM_HSBMASK) HFLASHC HSB Clock Mask */
#define PM_HSBMASK_HFLASHC          (0x1u << PM_HSBMASK_HFLASHC_Pos)
#define PM_HSBMASK_HRAMC1_Pos       2            /**< \brief (PM_HSBMASK) HRAMC1 HSB Clock Mask */
#define PM_HSBMASK_HRAMC1           (0x1u << PM_HSBMASK_HRAMC1_Pos)
#define PM_HSBMASK_USBC_Pos         3            /**< \brief (PM_HSBMASK) USBC HSB Clock Mask */
#define PM_HSBMASK_USBC             (0x1u << PM_HSBMASK_USBC_Pos)
#define PM_HSBMASK_CRCCU_Pos        4            /**< \brief (PM_HSBMASK) CRCCU HSB Clock Mask */
#define PM_HSBMASK_CRCCU            (0x1u << PM_HSBMASK_CRCCU_Pos)
#define PM_HSBMASK_HTOP0_Pos        5            /**< \brief (PM_HSBMASK) HTOP0 HSB Clock Mask */
#define PM_HSBMASK_HTOP0            (0x1u << PM_HSBMASK_HTOP0_Pos)
#define PM_HSBMASK_HTOP1_Pos        6            /**< \brief (PM_HSBMASK) HTOP1 HSB Clock Mask */
#define PM_HSBMASK_HTOP1            (0x1u << PM_HSBMASK_HTOP1_Pos)
#define PM_HSBMASK_HTOP2_Pos        7            /**< \brief (PM_HSBMASK) HTOP2 HSB Clock Mask */
#define PM_HSBMASK_HTOP2            (0x1u << PM_HSBMASK_HTOP2_Pos)
#define PM_HSBMASK_HTOP3_Pos        8            /**< \brief (PM_HSBMASK) HTOP3 HSB Clock Mask */
#define PM_HSBMASK_HTOP3            (0x1u << PM_HSBMASK_HTOP3_Pos)
#define PM_HSBMASK_AESA_Pos         9            /**< \brief (PM_HSBMASK) AESA HSB Clock Mask */
#define PM_HSBMASK_AESA             (0x1u << PM_HSBMASK_AESA_Pos)
#define PM_HSBMASK_MASK             0x000003FFu  /**< \brief (PM_HSBMASK) MASK Register */

/* -------- PM_PBAMASK : (PM Offset: 0x028) (R/W 32) PBA Mask -------- */
#define PM_PBAMASK_OFFSET           0x028        /**< \brief (PM_PBAMASK offset) PBA Mask */
#define PM_PBAMASK_RESETVALUE       0x00000000   /**< \brief (PM_PBAMASK reset_value) PBA Mask */

#define PM_PBAMASK_IISC_Pos         0            /**< \brief (PM_PBAMASK) IISC APB Clock Enable */
#define PM_PBAMASK_IISC             (0x1u << PM_PBAMASK_IISC_Pos)
#define PM_PBAMASK_SPI_Pos          1            /**< \brief (PM_PBAMASK) SPI APB Clock Enable */
#define PM_PBAMASK_SPI              (0x1u << PM_PBAMASK_SPI_Pos)
#define PM_PBAMASK_TC0_Pos          2            /**< \brief (PM_PBAMASK) TC0 APB Clock Enable */
#define PM_PBAMASK_TC0              (0x1u << PM_PBAMASK_TC0_Pos)
#define PM_PBAMASK_TC1_Pos          3            /**< \brief (PM_PBAMASK) TC1 APB Clock Enable */
#define PM_PBAMASK_TC1              (0x1u << PM_PBAMASK_TC1_Pos)
#define PM_PBAMASK_TWIM0_Pos        4            /**< \brief (PM_PBAMASK) TWIM0 APB Clock Enable */
#define PM_PBAMASK_TWIM0            (0x1u << PM_PBAMASK_TWIM0_Pos)
#define PM_PBAMASK_TWIS0_Pos        5            /**< \brief (PM_PBAMASK) TWIS0 APB Clock Enable */
#define PM_PBAMASK_TWIS0            (0x1u << PM_PBAMASK_TWIS0_Pos)
#define PM_PBAMASK_TWIM1_Pos        6            /**< \brief (PM_PBAMASK) TWIM1 APB Clock Enable */
#define PM_PBAMASK_TWIM1            (0x1u << PM_PBAMASK_TWIM1_Pos)
#define PM_PBAMASK_TWIS1_Pos        7            /**< \brief (PM_PBAMASK) TWIS1 APB Clock Enable */
#define PM_PBAMASK_TWIS1            (0x1u << PM_PBAMASK_TWIS1_Pos)
#define PM_PBAMASK_USART0_Pos       8            /**< \brief (PM_PBAMASK) USART0 APB Clock Enable */
#define PM_PBAMASK_USART0           (0x1u << PM_PBAMASK_USART0_Pos)
#define PM_PBAMASK_USART1_Pos       9            /**< \brief (PM_PBAMASK) USART1 APB Clock Enable */
#define PM_PBAMASK_USART1           (0x1u << PM_PBAMASK_USART1_Pos)
#define PM_PBAMASK_USART2_Pos       10           /**< \brief (PM_PBAMASK) USART2 APB Clock Enable */
#define PM_PBAMASK_USART2           (0x1u << PM_PBAMASK_USART2_Pos)
#define PM_PBAMASK_USART3_Pos       11           /**< \brief (PM_PBAMASK) USART3 APB Clock Enable */
#define PM_PBAMASK_USART3           (0x1u << PM_PBAMASK_USART3_Pos)
#define PM_PBAMASK_ADCIFE_Pos       12           /**< \brief (PM_PBAMASK) ADCIFE APB Clock Enable */
#define PM_PBAMASK_ADCIFE           (0x1u << PM_PBAMASK_ADCIFE_Pos)
#define PM_PBAMASK_DACC_Pos         13           /**< \brief (PM_PBAMASK) DACC APB Clock Enable */
#define PM_PBAMASK_DACC             (0x1u << PM_PBAMASK_DACC_Pos)
#define PM_PBAMASK_ACIFC_Pos        14           /**< \brief (PM_PBAMASK) ACIFC APB Clock Enable */
#define PM_PBAMASK_ACIFC            (0x1u << PM_PBAMASK_ACIFC_Pos)
#define PM_PBAMASK_GLOC_Pos         15           /**< \brief (PM_PBAMASK) GLOC APB Clock Enable */
#define PM_PBAMASK_GLOC             (0x1u << PM_PBAMASK_GLOC_Pos)
#define PM_PBAMASK_ABDACB_Pos       16           /**< \brief (PM_PBAMASK) ABDACB APB Clock Enable */
#define PM_PBAMASK_ABDACB           (0x1u << PM_PBAMASK_ABDACB_Pos)
#define PM_PBAMASK_TRNG_Pos         17           /**< \brief (PM_PBAMASK) TRNG APB Clock Enable */
#define PM_PBAMASK_TRNG             (0x1u << PM_PBAMASK_TRNG_Pos)
#define PM_PBAMASK_PARC_Pos         18           /**< \brief (PM_PBAMASK) PARC APB Clock Enable */
#define PM_PBAMASK_PARC             (0x1u << PM_PBAMASK_PARC_Pos)
#define PM_PBAMASK_CATB_Pos         19           /**< \brief (PM_PBAMASK) CATB APB Clock Enable */
#define PM_PBAMASK_CATB             (0x1u << PM_PBAMASK_CATB_Pos)
#define PM_PBAMASK_TWIM2_Pos        21           /**< \brief (PM_PBAMASK) TWIM2 APB Clock Enable */
#define PM_PBAMASK_TWIM2            (0x1u << PM_PBAMASK_TWIM2_Pos)
#define PM_PBAMASK_TWIM3_Pos        22           /**< \brief (PM_PBAMASK) TWIM3 APB Clock Enable */
#define PM_PBAMASK_TWIM3            (0x1u << PM_PBAMASK_TWIM3_Pos)
#define PM_PBAMASK_LCDCA_Pos        23           /**< \brief (PM_PBAMASK) LCDCA APB Clock Enable */
#define PM_PBAMASK_LCDCA            (0x1u << PM_PBAMASK_LCDCA_Pos)
#define PM_PBAMASK_MASK             0x00EFFFFFu  /**< \brief (PM_PBAMASK) MASK Register */

/* -------- PM_PBBMASK : (PM Offset: 0x02C) (R/W 32) PBB Mask -------- */
#define PM_PBBMASK_OFFSET           0x02C        /**< \brief (PM_PBBMASK offset) PBB Mask */
#define PM_PBBMASK_RESETVALUE       0x00000001   /**< \brief (PM_PBBMASK reset_value) PBB Mask */

