synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pm.h
#define PM_PBBMASK_HFLASHC_Pos      0            /**< \brief (PM_PBBMASK) HFLASHC APB Clock Enable */
#define PM_PBBMASK_HFLASHC          (0x1u << PM_PBBMASK_HFLASHC_Pos)
#define PM_PBBMASK_HCACHE_Pos       1            /**< \brief (PM_PBBMASK) HCACHE APB Clock Enable */
#define PM_PBBMASK_HCACHE           (0x1u << PM_PBBMASK_HCACHE_Pos)
#define PM_PBBMASK_HMATRIX_Pos      2            /**< \brief (PM_PBBMASK) HMATRIX APB Clock Enable */
#define PM_PBBMASK_HMATRIX          (0x1u << PM_PBBMASK_HMATRIX_Pos)
#define PM_PBBMASK_PDCA_Pos         3            /**< \brief (PM_PBBMASK) PDCA APB Clock Enable */
#define PM_PBBMASK_PDCA             (0x1u << PM_PBBMASK_PDCA_Pos)
#define PM_PBBMASK_CRCCU_Pos        4            /**< \brief (PM_PBBMASK) CRCCU APB Clock Enable */
#define PM_PBBMASK_CRCCU            (0x1u << PM_PBBMASK_CRCCU_Pos)
#define PM_PBBMASK_USBC_Pos         5            /**< \brief (PM_PBBMASK) USBC APB Clock Enable */
#define PM_PBBMASK_USBC             (0x1u << PM_PBBMASK_USBC_Pos)
#define PM_PBBMASK_PEVC_Pos         6            /**< \brief (PM_PBBMASK) PEVC APB Clock Enable */
#define PM_PBBMASK_PEVC             (0x1u << PM_PBBMASK_PEVC_Pos)
#define PM_PBBMASK_MASK             0x0000007Fu  /**< \brief (PM_PBBMASK) MASK Register */

/* -------- PM_PBCMASK : (PM Offset: 0x030) (R/W 32) PBC Mask -------- */
#define PM_PBCMASK_OFFSET           0x030        /**< \brief (PM_PBCMASK offset) PBC Mask */
#define PM_PBCMASK_RESETVALUE       0x0000001F   /**< \brief (PM_PBCMASK reset_value) PBC Mask */

#define PM_PBCMASK_PM_Pos           0            /**< \brief (PM_PBCMASK) PM APB Clock Enable */
#define PM_PBCMASK_PM               (0x1u << PM_PBCMASK_PM_Pos)
#define PM_PBCMASK_CHIPID_Pos       1            /**< \brief (PM_PBCMASK) CHIPID APB Clock Enable */
#define PM_PBCMASK_CHIPID           (0x1u << PM_PBCMASK_CHIPID_Pos)
#define PM_PBCMASK_SCIF_Pos         2            /**< \brief (PM_PBCMASK) SCIF APB Clock Enable */
#define PM_PBCMASK_SCIF             (0x1u << PM_PBCMASK_SCIF_Pos)
#define PM_PBCMASK_FREQM_Pos        3            /**< \brief (PM_PBCMASK) FREQM APB Clock Enable */
#define PM_PBCMASK_FREQM            (0x1u << PM_PBCMASK_FREQM_Pos)
#define PM_PBCMASK_GPIO_Pos         4            /**< \brief (PM_PBCMASK) GPIO APB Clock Enable */
#define PM_PBCMASK_GPIO             (0x1u << PM_PBCMASK_GPIO_Pos)
#define PM_PBCMASK_MASK             0x0000001Fu  /**< \brief (PM_PBCMASK) MASK Register */

/* -------- PM_PBDMASK : (PM Offset: 0x034) (R/W 32) PBD Mask -------- */
#define PM_PBDMASK_OFFSET           0x034        /**< \brief (PM_PBDMASK offset) PBD Mask */
#define PM_PBDMASK_RESETVALUE       0x0000003F   /**< \brief (PM_PBDMASK reset_value) PBD Mask */

#define PM_PBDMASK_BPM_Pos          0            /**< \brief (PM_PBDMASK) BPM APB Clock Enable */
#define PM_PBDMASK_BPM              (0x1u << PM_PBDMASK_BPM_Pos)
#define PM_PBDMASK_BSCIF_Pos        1            /**< \brief (PM_PBDMASK) BSCIF APB Clock Enable */
#define PM_PBDMASK_BSCIF            (0x1u << PM_PBDMASK_BSCIF_Pos)
#define PM_PBDMASK_AST_Pos          2            /**< \brief (PM_PBDMASK) AST APB Clock Enable */
#define PM_PBDMASK_AST              (0x1u << PM_PBDMASK_AST_Pos)
#define PM_PBDMASK_WDT_Pos          3            /**< \brief (PM_PBDMASK) WDT APB Clock Enable */
#define PM_PBDMASK_WDT              (0x1u << PM_PBDMASK_WDT_Pos)
#define PM_PBDMASK_EIC_Pos          4            /**< \brief (PM_PBDMASK) EIC APB Clock Enable */
#define PM_PBDMASK_EIC              (0x1u << PM_PBDMASK_EIC_Pos)
#define PM_PBDMASK_PICOUART_Pos     5            /**< \brief (PM_PBDMASK) PICOUART APB Clock Enable */
#define PM_PBDMASK_PICOUART         (0x1u << PM_PBDMASK_PICOUART_Pos)
#define PM_PBDMASK_MASK             0x0000003Fu  /**< \brief (PM_PBDMASK) MASK Register */

/* -------- PM_PBADIVMASK : (PM Offset: 0x040) (R/W 32) PBA Divided Clock Mask -------- */
#define PM_PBADIVMASK_OFFSET        0x040        /**< \brief (PM_PBADIVMASK offset) PBA Divided Clock Mask */
#define PM_PBADIVMASK_RESETVALUE    0x00000000   /**< \brief (PM_PBADIVMASK reset_value) PBA Divided Clock Mask */
#define PM_PBADIVMASK_MASK          0xFFFFFFFFu  /**< \brief (PM_PBADIVMASK) MASK Register */

/* -------- PM_CFDCTRL : (PM Offset: 0x054) (R/W 32) Clock Failure Detector Control -------- */
#define PM_CFDCTRL_OFFSET           0x054        /**< \brief (PM_CFDCTRL offset) Clock Failure Detector Control */
#define PM_CFDCTRL_RESETVALUE       0x00000000   /**< \brief (PM_CFDCTRL reset_value) Clock Failure Detector Control */

#define PM_CFDCTRL_CFDEN_Pos        0            /**< \brief (PM_CFDCTRL) Clock Failure Detection Enable */
#define PM_CFDCTRL_CFDEN            (0x1u << PM_CFDCTRL_CFDEN_Pos)
#define PM_CFDCTRL_SFV_Pos          31           /**< \brief (PM_CFDCTRL) Store Final Value */
#define PM_CFDCTRL_SFV              (0x1u << PM_CFDCTRL_SFV_Pos)
#define PM_CFDCTRL_MASK             0x80000001u  /**< \brief (PM_CFDCTRL) MASK Register */

/* -------- PM_UNLOCK : (PM Offset: 0x058) ( /W 32) Unlock Register -------- */
#define PM_UNLOCK_OFFSET            0x058        /**< \brief (PM_UNLOCK offset) Unlock Register */
#define PM_UNLOCK_RESETVALUE        0x00000000   /**< \brief (PM_UNLOCK reset_value) Unlock Register */

#define PM_UNLOCK_ADDR_Pos          0            /**< \brief (PM_UNLOCK) Unlock Address */
#define PM_UNLOCK_ADDR_Msk          (0x3FFu << PM_UNLOCK_ADDR_Pos)
#define PM_UNLOCK_ADDR(value)       ((PM_UNLOCK_ADDR_Msk & ((value) << PM_UNLOCK_ADDR_Pos)))
#define PM_UNLOCK_KEY_Pos           24           /**< \brief (PM_UNLOCK) Unlock Key */
#define PM_UNLOCK_KEY_Msk           (0xFFu << PM_UNLOCK_KEY_Pos)
#define PM_UNLOCK_KEY(value)        ((PM_UNLOCK_KEY_Msk & ((value) << PM_UNLOCK_KEY_Pos)))
#define PM_UNLOCK_MASK              0xFF0003FFu  /**< \brief (PM_UNLOCK) MASK Register */

/* -------- PM_IER : (PM Offset: 0x0C0) ( /W 32) Interrupt Enable Register -------- */
#define PM_IER_OFFSET               0x0C0        /**< \brief (PM_IER offset) Interrupt Enable Register */
#define PM_IER_RESETVALUE           0x00000000   /**< \brief (PM_IER reset_value) Interrupt Enable Register */

#define PM_IER_CFD_Pos              0            /**< \brief (PM_IER) Clock Failure Detected Interrupt Enable */
#define PM_IER_CFD                  (0x1u << PM_IER_CFD_Pos)
#define PM_IER_CKRDY_Pos            5            /**< \brief (PM_IER) Clock Ready Interrupt Enable */
#define PM_IER_CKRDY                (0x1u << PM_IER_CKRDY_Pos)
#define PM_IER_WAKE_Pos             8            /**< \brief (PM_IER) Wake up Interrupt Enable */
#define PM_IER_WAKE                 (0x1u << PM_IER_WAKE_Pos)
#define   PM_IER_WAKE_0_Val               0x0u   /**< \brief (PM_IER) No effect */
#define   PM_IER_WAKE_1_Val               0x1u   /**< \brief (PM_IER) Disable Interrupt. */
#define PM_IER_WAKE_0               (PM_IER_WAKE_0_Val             << PM_IER_WAKE_Pos)
#define PM_IER_WAKE_1               (PM_IER_WAKE_1_Val             << PM_IER_WAKE_Pos)
#define PM_IER_AE_Pos               31           /**< \brief (PM_IER) Access Error Interrupt Enable */
#define PM_IER_AE                   (0x1u << PM_IER_AE_Pos)
#define PM_IER_MASK                 0x80000121u  /**< \brief (PM_IER) MASK Register */

