synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pm.h
#define PM_PPCR_RSTPUN_Pos          0            /**< \brief (PM_PPCR) Reset Pullup */
#define PM_PPCR_RSTPUN              (0x1u << PM_PPCR_RSTPUN_Pos)
#define PM_PPCR_CATBRCMASK_Pos      1            /**< \brief (PM_PPCR) CAT Request Clock Mask */
#define PM_PPCR_CATBRCMASK          (0x1u << PM_PPCR_CATBRCMASK_Pos)
#define PM_PPCR_ACIFCRCMASK_Pos     2            /**< \brief (PM_PPCR) ACIFC Request Clock Mask */
#define PM_PPCR_ACIFCRCMASK         (0x1u << PM_PPCR_ACIFCRCMASK_Pos)
#define PM_PPCR_ASTRCMASK_Pos       3            /**< \brief (PM_PPCR) AST Request Clock Mask */
#define PM_PPCR_ASTRCMASK           (0x1u << PM_PPCR_ASTRCMASK_Pos)
#define PM_PPCR_TWIS0RCMASK_Pos     4            /**< \brief (PM_PPCR) TWIS0 Request Clock Mask */
#define PM_PPCR_TWIS0RCMASK         (0x1u << PM_PPCR_TWIS0RCMASK_Pos)
#define PM_PPCR_TWIS1RCMASK_Pos     5            /**< \brief (PM_PPCR) TWIS1 Request Clock Mask */
#define PM_PPCR_TWIS1RCMASK         (0x1u << PM_PPCR_TWIS1RCMASK_Pos)
#define PM_PPCR_PEVCRCMASK_Pos      6            /**< \brief (PM_PPCR) PEVC Request Clock Mask */
#define PM_PPCR_PEVCRCMASK          (0x1u << PM_PPCR_PEVCRCMASK_Pos)
#define PM_PPCR_ADCIFERCMASK_Pos    7            /**< \brief (PM_PPCR) ADCIFE Request Clock Mask */
#define PM_PPCR_ADCIFERCMASK        (0x1u << PM_PPCR_ADCIFERCMASK_Pos)
#define PM_PPCR_VREGRCMASK_Pos      8            /**< \brief (PM_PPCR) VREG Request Clock Mask */
#define PM_PPCR_VREGRCMASK          (0x1u << PM_PPCR_VREGRCMASK_Pos)
#define PM_PPCR_FWBGREF_Pos         9            /**< \brief (PM_PPCR) Flash Wait BGREF */
#define PM_PPCR_FWBGREF             (0x1u << PM_PPCR_FWBGREF_Pos)
#define PM_PPCR_FWBOD18_Pos         10           /**< \brief (PM_PPCR) Flash Wait BOD18 */
#define PM_PPCR_FWBOD18             (0x1u << PM_PPCR_FWBOD18_Pos)
#define PM_PPCR_MASK                0x000007FFu  /**< \brief (PM_PPCR) MASK Register */

/* -------- PM_RCAUSE : (PM Offset: 0x180) (R/  32) Reset Cause Register -------- */
#define PM_RCAUSE_OFFSET            0x180        /**< \brief (PM_RCAUSE offset) Reset Cause Register */
#define PM_RCAUSE_RESETVALUE        0x00000000   /**< \brief (PM_RCAUSE reset_value) Reset Cause Register */

#define PM_RCAUSE_POR_Pos           0            /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_POR               (0x1u << PM_RCAUSE_POR_Pos)
#define PM_RCAUSE_BOD_Pos           1            /**< \brief (PM_RCAUSE) Brown-out Reset */
#define PM_RCAUSE_BOD               (0x1u << PM_RCAUSE_BOD_Pos)
#define PM_RCAUSE_EXT_Pos           2            /**< \brief (PM_RCAUSE) External Reset Pin */
#define PM_RCAUSE_EXT               (0x1u << PM_RCAUSE_EXT_Pos)
#define PM_RCAUSE_WDT_Pos           3            /**< \brief (PM_RCAUSE) Watchdog Reset */
#define PM_RCAUSE_WDT               (0x1u << PM_RCAUSE_WDT_Pos)
#define PM_RCAUSE_OCDRST_Pos        8            /**< \brief (PM_RCAUSE) OCD Reset */
#define PM_RCAUSE_OCDRST            (0x1u << PM_RCAUSE_OCDRST_Pos)
#define PM_RCAUSE_POR33_Pos         10           /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_POR33             (0x1u << PM_RCAUSE_POR33_Pos)
#define PM_RCAUSE_BOD33_Pos         13           /**< \brief (PM_RCAUSE) Brown-out 3.3V Reset */
#define PM_RCAUSE_BOD33             (0x1u << PM_RCAUSE_BOD33_Pos)
#define PM_RCAUSE_MASK              0x0000250Fu  /**< \brief (PM_RCAUSE) MASK Register */

/* -------- PM_WCAUSE : (PM Offset: 0x184) (R/  32) Wake Cause Register -------- */
#define PM_WCAUSE_OFFSET            0x184        /**< \brief (PM_WCAUSE offset) Wake Cause Register */
#define PM_WCAUSE_RESETVALUE        0x00000000   /**< \brief (PM_WCAUSE reset_value) Wake Cause Register */

#define PM_WCAUSE_TWI_SLAVE_0_Pos   0            /**< \brief (PM_WCAUSE) Two-wire Slave Interface 0 */
#define PM_WCAUSE_TWI_SLAVE_0       (0x1u << PM_WCAUSE_TWI_SLAVE_0_Pos)
#define PM_WCAUSE_TWI_SLAVE_1_Pos   1            /**< \brief (PM_WCAUSE) Two-wire Slave Interface 1 */
#define PM_WCAUSE_TWI_SLAVE_1       (0x1u << PM_WCAUSE_TWI_SLAVE_1_Pos)
#define PM_WCAUSE_USBC_Pos          2            /**< \brief (PM_WCAUSE) USB Device and Embedded Host Interface */
#define PM_WCAUSE_USBC              (0x1u << PM_WCAUSE_USBC_Pos)
#define PM_WCAUSE_PSOK_Pos          3            /**< \brief (PM_WCAUSE) Power Scaling OK */
#define PM_WCAUSE_PSOK              (0x1u << PM_WCAUSE_PSOK_Pos)
#define PM_WCAUSE_BOD18_IRQ_Pos     4            /**< \brief (PM_WCAUSE) BOD18 Interrupt */
#define PM_WCAUSE_BOD18_IRQ         (0x1u << PM_WCAUSE_BOD18_IRQ_Pos)
#define PM_WCAUSE_BOD33_IRQ_Pos     5            /**< \brief (PM_WCAUSE) BOD33 Interrupt */
#define PM_WCAUSE_BOD33_IRQ         (0x1u << PM_WCAUSE_BOD33_IRQ_Pos)
#define PM_WCAUSE_PICOUART_Pos      6            /**< \brief (PM_WCAUSE) Picopower UART */
#define PM_WCAUSE_PICOUART          (0x1u << PM_WCAUSE_PICOUART_Pos)
#define PM_WCAUSE_LCDCA_Pos         7            /**< \brief (PM_WCAUSE) LCD Controller */
#define PM_WCAUSE_LCDCA             (0x1u << PM_WCAUSE_LCDCA_Pos)
#define PM_WCAUSE_EIC_Pos           16           /**< \brief (PM_WCAUSE) External Interrupt Controller */
#define PM_WCAUSE_EIC               (0x1u << PM_WCAUSE_EIC_Pos)
#define PM_WCAUSE_AST_Pos           17           /**< \brief (PM_WCAUSE) Asynchronous Timer */
#define PM_WCAUSE_AST               (0x1u << PM_WCAUSE_AST_Pos)
#define PM_WCAUSE_MASK              0x000300FFu  /**< \brief (PM_WCAUSE) MASK Register */

/* -------- PM_AWEN : (PM Offset: 0x188) (R/W 32) Asynchronous Wake Enable -------- */
#define PM_AWEN_OFFSET              0x188        /**< \brief (PM_AWEN offset) Asynchronous Wake Enable */
#define PM_AWEN_RESETVALUE          0x00000000   /**< \brief (PM_AWEN reset_value) Asynchronous Wake Enable */

#define PM_AWEN_AWEN_Pos            0            /**< \brief (PM_AWEN) Asynchronous Wake Up */
#define PM_AWEN_AWEN_Msk            (0xFFFFFFFFu << PM_AWEN_AWEN_Pos)
#define PM_AWEN_AWEN(value)         ((PM_AWEN_AWEN_Msk & ((value) << PM_AWEN_AWEN_Pos)))
#define PM_AWEN_MASK                0xFFFFFFFFu  /**< \brief (PM_AWEN) MASK Register */

