synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/component/pm.h
/* -------- PM_OBS : (PM Offset: 0x190) (R/W 32) Obsvervability -------- */
#define PM_OBS_OFFSET               0x190        /**< \brief (PM_OBS offset) Obsvervability */
#define PM_OBS_RESETVALUE           0x00000000   /**< \brief (PM_OBS reset_value) Obsvervability */

#define PM_OBS_MASK                 0x00000000u  /**< \brief (PM_OBS) MASK Register */

/* -------- PM_FASTSLEEP : (PM Offset: 0x194) (R/W 32) Fast Sleep Register -------- */
#define PM_FASTSLEEP_OFFSET         0x194        /**< \brief (PM_FASTSLEEP offset) Fast Sleep Register */
#define PM_FASTSLEEP_RESETVALUE     0x00000000   /**< \brief (PM_FASTSLEEP reset_value) Fast Sleep Register */

#define PM_FASTSLEEP_OSC_Pos        0            /**< \brief (PM_FASTSLEEP) Oscillator */
#define PM_FASTSLEEP_OSC            (0x1u << PM_FASTSLEEP_OSC_Pos)
#define PM_FASTSLEEP_PLL_Pos        8            /**< \brief (PM_FASTSLEEP) PLL */
#define PM_FASTSLEEP_PLL            (0x1u << PM_FASTSLEEP_PLL_Pos)
#define PM_FASTSLEEP_FASTRCOSC_Pos  16           /**< \brief (PM_FASTSLEEP) RC80 or FLO */
#define PM_FASTSLEEP_FASTRCOSC_Msk  (0x1Fu << PM_FASTSLEEP_FASTRCOSC_Pos)
#define PM_FASTSLEEP_FASTRCOSC(value) ((PM_FASTSLEEP_FASTRCOSC_Msk & ((value) << PM_FASTSLEEP_FASTRCOSC_Pos)))
#define PM_FASTSLEEP_DFLL_Pos       24           /**< \brief (PM_FASTSLEEP) DFLL */
#define PM_FASTSLEEP_DFLL           (0x1u << PM_FASTSLEEP_DFLL_Pos)
#define PM_FASTSLEEP_MASK           0x011F0101u  /**< \brief (PM_FASTSLEEP) MASK Register */

/* -------- PM_CONFIG : (PM Offset: 0x3F8) (R/  32) Configuration Register -------- */
#define PM_CONFIG_OFFSET            0x3F8        /**< \brief (PM_CONFIG offset) Configuration Register */
#define PM_CONFIG_RESETVALUE        0x0000000F   /**< \brief (PM_CONFIG reset_value) Configuration Register */

#define PM_CONFIG_PBA_Pos           0            /**< \brief (PM_CONFIG) APBA Implemented */
#define PM_CONFIG_PBA               (0x1u << PM_CONFIG_PBA_Pos)
#define PM_CONFIG_PBB_Pos           1            /**< \brief (PM_CONFIG) APBB Implemented */
#define PM_CONFIG_PBB               (0x1u << PM_CONFIG_PBB_Pos)
#define PM_CONFIG_PBC_Pos           2            /**< \brief (PM_CONFIG) APBC Implemented */
#define PM_CONFIG_PBC               (0x1u << PM_CONFIG_PBC_Pos)
#define PM_CONFIG_PBD_Pos           3            /**< \brief (PM_CONFIG) APBD Implemented */
#define PM_CONFIG_PBD               (0x1u << PM_CONFIG_PBD_Pos)
#define PM_CONFIG_HSBPEVC_Pos       7            /**< \brief (PM_CONFIG) HSB PEVC Clock Implemented */
#define PM_CONFIG_HSBPEVC           (0x1u << PM_CONFIG_HSBPEVC_Pos)
#define PM_CONFIG_MASK              0x0000008Fu  /**< \brief (PM_CONFIG) MASK Register */

/* -------- PM_VERSION : (PM Offset: 0x3FC) (R/  32) Version Register -------- */
#define PM_VERSION_OFFSET           0x3FC        /**< \brief (PM_VERSION offset) Version Register */
#define PM_VERSION_RESETVALUE       0x00000441   /**< \brief (PM_VERSION reset_value) Version Register */

#define PM_VERSION_VERSION_Pos      0            /**< \brief (PM_VERSION) Version number */
#define PM_VERSION_VERSION_Msk      (0xFFFu << PM_VERSION_VERSION_Pos)
#define PM_VERSION_VERSION(value)   ((PM_VERSION_VERSION_Msk & ((value) << PM_VERSION_VERSION_Pos)))
#define PM_VERSION_VARIANT_Pos      16           /**< \brief (PM_VERSION) Variant number */
#define PM_VERSION_VARIANT_Msk      (0xFu << PM_VERSION_VARIANT_Pos)
#define PM_VERSION_VARIANT(value)   ((PM_VERSION_VARIANT_Msk & ((value) << PM_VERSION_VARIANT_Pos)))
#define PM_VERSION_MASK             0x000F0FFFu  /**< \brief (PM_VERSION) MASK Register */

/** \brief PM hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   PM_MCCTRL;          /**< \brief (PM Offset: 0x000) Main Clock Control */
  RwReg   PM_CPUSEL;          /**< \brief (PM Offset: 0x004) CPU Clock Select */
  RoReg8  Reserved1[0x4];
  RwReg   PM_PBASEL;          /**< \brief (PM Offset: 0x00C) PBA Clock Select */
  RwReg   PM_PBBSEL;          /**< \brief (PM Offset: 0x010) PBB Clock Select */
  RwReg   PM_PBCSEL;          /**< \brief (PM Offset: 0x014) PBC Clock Select */
  RwReg   PM_PBDSEL;          /**< \brief (PM Offset: 0x018) PBD Clock Select */
  RoReg8  Reserved2[0x4];
  RwReg   PM_CPUMASK;         /**< \brief (PM Offset: 0x020) CPU Mask */
  RwReg   PM_HSBMASK;         /**< \brief (PM Offset: 0x024) HSB Mask */
  RwReg   PM_PBAMASK;         /**< \brief (PM Offset: 0x028) PBA Mask */
  RwReg   PM_PBBMASK;         /**< \brief (PM Offset: 0x02C) PBB Mask */
  RwReg   PM_PBCMASK;         /**< \brief (PM Offset: 0x030) PBC Mask */
  RwReg   PM_PBDMASK;         /**< \brief (PM Offset: 0x034) PBD Mask */
  RoReg8  Reserved3[0x8];
  RwReg   PM_PBADIVMASK;      /**< \brief (PM Offset: 0x040) PBA Divided Clock Mask */
  RoReg8  Reserved4[0x10];
  RwReg   PM_CFDCTRL;         /**< \brief (PM Offset: 0x054) Clock Failure Detector Control */
  WoReg   PM_UNLOCK;          /**< \brief (PM Offset: 0x058) Unlock Register */
  RoReg8  Reserved5[0x64];
  WoReg   PM_IER;             /**< \brief (PM Offset: 0x0C0) Interrupt Enable Register */
  WoReg   PM_IDR;             /**< \brief (PM Offset: 0x0C4) Interrupt Disable Register */
  RoReg   PM_IMR;             /**< \brief (PM Offset: 0x0C8) Interrupt Mask Register */
  RoReg   PM_ISR;             /**< \brief (PM Offset: 0x0CC) Interrupt Status Register */
  WoReg   PM_ICR;             /**< \brief (PM Offset: 0x0D0) Interrupt Clear Register */
  RoReg   PM_SR;              /**< \brief (PM Offset: 0x0D4) Status Register */
  RoReg8  Reserved6[0x88];
  RwReg   PM_PPCR;            /**< \brief (PM Offset: 0x160) Peripheral Power Control Register */
  RoReg8  Reserved7[0x1C];
  RoReg   PM_RCAUSE;          /**< \brief (PM Offset: 0x180) Reset Cause Register */
  RoReg   PM_WCAUSE;          /**< \brief (PM Offset: 0x184) Wake Cause Register */
  RwReg   PM_AWEN;            /**< \brief (PM Offset: 0x188) Asynchronous Wake Enable */
  RoReg8  Reserved8[0x4];
  RwReg   PM_OBS;             /**< \brief (PM Offset: 0x190) Obsvervability */
  RwReg   PM_FASTSLEEP;       /**< \brief (PM Offset: 0x194) Fast Sleep Register */
  RoReg8  Reserved9[0x260];
  RoReg   PM_CONFIG;          /**< \brief (PM Offset: 0x3F8) Configuration Register */
  RoReg   PM_VERSION;         /**< \brief (PM Offset: 0x3FC) Version Register */
} Pm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_PM_COMPONENT_ */
